Conf.Simple/src/DataProcessors/SUI_ВыгрузкаЗагрузкаНастроек/SUI_ВыгрузкаЗагрузкаНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>SUI_ВыгрузкаЗагрузкаНастроек</name>
</mdclass:DataProcessor>

Conf.Simple/src/InformationRegisters/SUI_НастройкиТаблицИнтеграции/SUI_НастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиТаблицИнтеграции</name>
  <resources>
    <name>НастройкиКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойОбъект</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъектаКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ДополнительныеНастройкиТаблицИнтеграции/SUI_ДополнительныеНастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ДополнительныеНастройкиТаблицИнтеграции</name>
  <resources>
    <name>ДанныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/SUI_НастройкиДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументовОбмена</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументОбменаПриЗаписиДокумента1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекОтбораДокументов</name>
    <comment>Настройки компоновки данных содержащие элементы отбора</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекРеквизитовДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиТаблиц</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьНеЗаполненные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеНастроекРеквизитовТаблицы</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработкиСтрокЗагрузкиДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаЗаполнениеРеквизитов</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаСозданиеДокументовНаОсновании</name>
    <attributes>
      <name>ИмяДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработчик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиИдентификацииСтрок</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/DataProcessors/SUI_ВыгрузкаЗагрузкаНастроек/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция КлючОбластиНастройкиДокументов() Экспорт
	Возврат "Documents";
КонецФункции

Функция КлючОбластиНастройкиТаблиц() Экспорт
	Возврат "IntegrationTables";
КонецФункции

Функция КлючОбластиДополнительныхНастроекТаблиц() Экспорт
	Возврат "IntegrationAdditional";
КонецФункции

Функция КлючОбластиПользовательскиеЗапросы() Экспорт
	Возврат "IntegrationQuery";
КонецФункции

Процедура ИнициализироватьОбластиНастроек(ОбластиНастроек, МассивОбластейИнициализации) Экспорт
	
	ОбластиНастроек.Добавить(КлючОбластиНастройкиДокументов(), НСтр("ru = 'Настройки документов'"));
	ОбластиНастроек.Добавить(КлючОбластиНастройкиТаблиц(), НСтр("ru = 'Настройки таблиц'"));
	ОбластиНастроек.Добавить(КлючОбластиДополнительныхНастроекТаблиц(), НСтр("ru = 'Дополнительные настройки таблиц'"));
	ОбластиНастроек.Добавить(КлючОбластиПользовательскиеЗапросы(), НСтр("ru = 'Пользовательские запросы'"));
	
	Если МассивОбластейИнициализации.Количество() > 0 Тогда
		РазностьСписка = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ОбластиНастроек.ВыгрузитьЗначения(), МассивОбластейИнициализации);
		Для индекс = 0 По РазностьСписка.ВГраница() Цикл
			ЭлементСпискаОбластей = ОбластиНастроек.НайтиПоЗначению(РазностьСписка[индекс]);
			Если ЭлементСпискаОбластей <> Неопределено Тогда
				ОбластиНастроек.Удалить(ЭлементСпискаОбластей);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьФайлВыгрузкиНастроекВФоне(Параметры, АдресРезультата) Экспорт
	
	Перем ВременныйКаталог;
	
	Попытка
		
		ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
		
		Манифест = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.migration-settings.simple", "ManifestFile"));
		Манифест.Date = ТекущаяДатаСеанса();
		
		ОписаниеКонфигурации = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.migration-settings.simple", "Configuration"));
		
		ОписаниеКонфигурации.Name = Метаданные.Имя;
		ОписаниеКонфигурации.Synonym = Метаданные.Синоним;
		ОписаниеКонфигурации.Version = Метаданные.Версия;
		ОписаниеКонфигурации.ExtensionVersion = SUI_Simple.Версия();
		
		ДанныеКХешированию = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
			ОписаниеКонфигурации.Name, ОписаниеКонфигурации.Version, ОписаниеКонфигурации.ExtensionVersion);
		ОписаниеКонфигурации.HEX = НРег(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ДанныеКХешированию));
		
		ОписаниеКонфигурации.Settings = ФабрикаXDTO.Создать(
			ФабрикаXDTO.Тип("http://www.migration-settings.simple", "Settings"));
		
		// Выгрузка настроек: Настройки документов
		ВыгрузитьНастройкиДокументов(ОписаниеКонфигурации, Параметры.ДеревоНастройки, ВременныйКаталог);
		
		// Выгрузка настроек: Таблицы интеграции
		ВыгрузитьНастройкиТаблиц(ОписаниеКонфигурации, Параметры.ДеревоНастройки, ВременныйКаталог);
		
		// Выгрузка настроек: Дополнительные настройки таблиц интеграции
		ВыгрузитьДополнительныхНастроекТаблиц(ОписаниеКонфигурации, Параметры.ДеревоНастройки, ВременныйКаталог);
		
		// Выгрузка настроек: Пользовательские запросы
		ВыгрузитьПользовательскиеЗапросы(ОписаниеКонфигурации, Параметры.ДеревоНастройки, ВременныйКаталог);
		
		Манифест.Configuration.Добавить(ОписаниеКонфигурации);
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.ОткрытьФайл(ИмяФайлаМанифест(ВременныйКаталог));
		ЗаписьXML.ЗаписатьБезОбработки(ОбщегоНазначения.ОбъектXDTOВСтрокуXML(Манифест));
		ЗаписьXML.Закрыть();
		
		ФайлАрхив = Новый ЗаписьZipФайла();
		ФайлАрхив.Добавить(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, "*.*"), 
			РежимСохраненияПутейZIP.СохранятьОтносительныеПути, 
			РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
		ФайлАрхив = ФайлАрхив.ПолучитьДвоичныеДанные(, , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
		
		ПоместитьВоВременноеХранилище(ФайлАрхив, АдресРезультата);
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ВременныйКаталог = Неопределено;
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Выгрузка'")), , 
			Метаданные.Обработки.SUI_ВыгрузкаЗагрузкаНастроек, , ИнформацияОбОшибке());
		Если ЗначениеЗаполнено(ВременныйКаталог) Тогда
			ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗагрузитьМанифестНастроекВДеревоВФоне(Параметры, АдресРезультата) Экспорт
	
	Перем ВременныйКаталог;
	
	Попытка
		
		СписокКонфигураций = Новый СписокЗначений();
		ДеревоНастройки = Параметры.ДеревоНастройки;
		ДеревоНастройки.Строки.Очистить();
		
		ТипМанифест = ФабрикаXDTO.Тип("http://www.migration-settings.simple", "ManifestFile");
		Манифест = Неопределено;
		
		ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
		
		ФайлАрхив = Новый ЧтениеZipФайла(Параметры.ДанныеФайла.ОткрытьПотокДляЧтения());
		
		ФайлМанифест = ФайлАрхив.Элементы.Найти(ИмяФайлаМанифест());
		
		Если ФайлМанифест <> Неопределено Тогда
			
			ФайлАрхив.Извлечь(ФайлМанифест, ВременныйКаталог, РежимВосстановленияПутейФайловZIP.Восстанавливать);
			
			ЧтениеXML = Новый ЧтениеXML();
			ЧтениеXML.ОткрытьФайл(ИмяФайлаМанифест(ВременныйКаталог));
			Манифест = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипМанифест);
			ЧтениеXML.Закрыть();
			
		КонецЕсли;
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ВременныйКаталог = Неопределено;
		
		Если Манифест <> Неопределено Тогда
			
			Для Каждого ОписаниеКонфигурации Из Манифест.Configuration Цикл
				
				ОбщегоНазначенияКлиентСервер.Проверить(
					ДеревоНастройки.Строки.Найти(ОписаниеКонфигурации.HEX, "КонфигурацияHEX", Ложь) = Неопределено,
					НСтр("ru = 'Манифест настроек содержит некорректные данные.
					|Совпадение хеш сумм конфигураций.'"));
				
				СтрокаОписаниеКонфигурации = ДеревоНастройки.Строки.Добавить();
				СтрокаОписаниеКонфигурации.КонфигурацияHEX = ОписаниеКонфигурации.HEX;
				СтрокаОписаниеКонфигурации.КонфигурацияИмя = ОписаниеКонфигурации.Name;
				СтрокаОписаниеКонфигурации.КонфигурацияСиноним = ОписаниеКонфигурации.Synonym;
				СтрокаОписаниеКонфигурации.КонфигурацияВерсия = ОписаниеКонфигурации.Version;
				СтрокаОписаниеКонфигурации.РасширениеВерсия = ОписаниеКонфигурации.ExtensionVersion;
				СтрокаОписаниеКонфигурации.Представление = СтрокаОписаниеКонфигурации.КонфигурацияСиноним;
				
				Если Не ПустаяСтрока(СтрокаОписаниеКонфигурации.КонфигурацияВерсия) Тогда
					СтрокаОписаниеКонфигурации.Представление = СтрокаОписаниеКонфигурации.Представление 
						+ " (" + СтрокаОписаниеКонфигурации.КонфигурацияВерсия + ")";
				КонецЕсли;
				
				Если Не ПустаяСтрока(СтрокаОписаниеКонфигурации.РасширениеВерсия) Тогда
					СтрокаОписаниеКонфигурации.Представление = СтрШаблон("%1 %2 (%3)", 
						СтрокаОписаниеКонфигурации.Представление, 
						SUI_SimpleКлиентСервер.Представление(),
						СтрокаОписаниеКонфигурации.РасширениеВерсия);
				КонецЕсли;
				
				Для Каждого СвойствоSettings Из ОписаниеКонфигурации.Settings.Свойства() Цикл
					
					Если ОписаниеКонфигурации.Settings[СвойствоSettings.Имя] = Неопределено Или
						ОписаниеКонфигурации.Settings[СвойствоSettings.Имя].Files.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					ОбластьИзСписка = Параметры.ОбластиНастроек.НайтиПоЗначению(СвойствоSettings.Имя);
					
					Если ОбластьИзСписка = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаОписаниеОбласти = СтрокаОписаниеКонфигурации.Строки.Добавить();
					СтрокаОписаниеОбласти.Область = СвойствоSettings.Имя;
					СтрокаОписаниеОбласти.Представление = ОбластьИзСписка.Представление;
					
					Для Каждого ОписаниеФайла Из ОписаниеКонфигурации.Settings[СвойствоSettings.Имя].Files Цикл
						
						СтрокаОписаниеФайла = СтрокаОписаниеОбласти.Строки.Добавить();
						СтрокаОписаниеФайла.НастройкаID = ОписаниеФайла.ID;
						СтрокаОписаниеФайла.НастройкаНаименование = ОписаниеФайла.Name;
						СтрокаОписаниеФайла.НастройкаОписание = ОписаниеФайла.Description;
						
						Ключ = Неопределено;
						
						// Настройки документов
						Если СвойствоSettings.Имя = КлючОбластиНастройкиДокументов() Тогда
							
							СтрокаОписаниеФайла.ЭтоНастройкаДокумента = Истина;
							
							Если Параметры.Свойство("КлючНастроекДокументов") Тогда
								Ключ = Параметры.КлючНастроекДокументов;
							ИначеЕсли СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ОписаниеФайла.Key) Тогда
								
								Ключ = Новый УникальныйИдентификатор(ОписаниеФайла.Key);
								
								Если ЗначениеЗаполнено(Ключ) Тогда
									
									КлючСсылка = Справочники.SUI_НастройкиДокументовОбмена.ПолучитьСсылку(Ключ);
									
									Если ОбщегоНазначения.СсылкаСуществует(КлючСсылка) Тогда
										СтрокаОписаниеФайла.Представление = СтрШаблон("%1 > %2", 
											СтрокаОписаниеФайла.НастройкаНаименование, КлючСсылка);
										СтрокаОписаниеФайла.СопоставленнаяНастройка = КлючСсылка;
										Ключ = КлючСсылка;
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;
							
						// Настройки таблиц интеграции
						ИначеЕсли СвойствоSettings.Имя = КлючОбластиНастройкиТаблиц() Тогда
							
							Ключи = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
								ОписаниеФайла.Key, "&", Истина, Истина);
							
							Если Ключи.Количество() = 2 Тогда
								
								Ключ = Новый Структура();
								Ключ.Вставить("ТаблицаИнтеграции", Перечисления.SUI_ТаблицыИнтеграции[Ключи[0]]);
								Ключ.Вставить("ИмяОбъектаКонфигурации", Ключи[1]);
								
								СтрокаОписаниеФайла.Представление = СтрШаблон("%1 (%2)", 
									Ключ.ТаблицаИнтеграции,
									Ключ.ИмяОбъектаКонфигурации);
								
							КонецЕсли;
							
						// Дополнительные настройки таблиц интеграций
						ИначеЕсли СвойствоSettings.Имя = КлючОбластиДополнительныхНастроекТаблиц() Тогда
							
							Ключ = Новый Структура();
							Ключ.Вставить("ТаблицаИнтеграции", Перечисления.SUI_ТаблицыИнтеграции[ОписаниеФайла.Key]);
							
							СтрокаОписаниеФайла.Представление = Ключ.ТаблицаИнтеграции;
							
						// Пользовательские запросы
						ИначеЕсли СвойствоSettings.Имя = КлючОбластиПользовательскиеЗапросы() Тогда
							Ключ = ОписаниеФайла.Key;
						КонецЕсли;
						
						Если Ключ = Неопределено Тогда
							СтрокаОписаниеОбласти.Строки.Удалить(СтрокаОписаниеФайла);
						Иначе
							
							СтрокаОписаниеФайла.НастройкаКлюч = Ключ;
							
							Если ПустаяСтрока(СтрокаОписаниеФайла.Представление) Тогда
								СтрокаОписаниеФайла.Представление = СтрокаОписаниеФайла.НастройкаНаименование;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если СтрокаОписаниеОбласти.Строки.Количество() = 0 Тогда
						СтрокаОписаниеКонфигурации.Строки.Удалить(СтрокаОписаниеОбласти);
					КонецЕсли;
					
				КонецЦикла;
				
				Если СтрокаОписаниеКонфигурации.Строки.Количество() = 0 Тогда
					ДеревоНастройки.Строки.Удалить(СтрокаОписаниеКонфигурации);
				Иначе
					СписокКонфигураций.Добавить(СтрокаОписаниеКонфигурации.КонфигурацияHEX, СтрокаОписаниеКонфигурации.Представление);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Результат = Новый Структура();
		Результат.Вставить("КонфигурацииСписок", СписокКонфигураций);
		Результат.Вставить("АдресДереваНастроек", 
			ПоместитьВоВременноеХранилище(ДеревоНастройки, Параметры.АдресРезультатаДерева));
		
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Загрузка'")), , 
			Метаданные.Обработки.SUI_ВыгрузкаЗагрузкаНастроек, , ИнформацияОбОшибке());
		Если ЗначениеЗаполнено(ВременныйКаталог) Тогда
			ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьВыбранныеНастройкиВФоне(Параметры, АдресРезультата) Экспорт
	
	Перем ВременныйКаталог;
	
	ЗаписьВыполнена = Ложь;
	
	НачатьТранзакцию();
	
	Попытка
		
		ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
		
		СтрокиКОбработке = ПолучитьСтрокиДереваНастроекКЗаписи(Параметры.ДеревоНастройки, ВременныйКаталог);
		
		СообщенияПользователю = Новый Массив();
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СообщенияПользователю, ПолучитьСообщенияПользователю(Истина));
		
		Если СтрокиКОбработке.Количество() > 0 Тогда
			
			ФайлАрхив = Новый ЧтениеZipФайла(Параметры.ДанныеФайла.ОткрытьПотокДляЧтения());
			ФайлАрхив.ИзвлечьВсе(ВременныйКаталог, РежимВосстановленияПутейФайловZIP.Восстанавливать);
			ФайлАрхив.Закрыть();
			
			Для Каждого ЭлементОбласть Из СтрокиКОбработке Цикл
				
				Запрос = ПодготовитьЗапросБлокировкиДанных(ЭлементОбласть.Ключ, ЭлементОбласть.Значение);
				
				Если Запрос = Неопределено Тогда
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = СтрШаблон(НСтр("ru = 'Неизвестная область %1. Запись настроек пропущена.'"), ЭлементОбласть.Ключ);
					СообщенияПользователю.Добавить(Сообщение);
					Продолжить;
				КонецЕсли;
				
				//@skip-check query-in-loop
				Запрос.Выполнить();
				
				Если ЭлементОбласть.Ключ = КлючОбластиНастройкиДокументов() И
					ЗаписатьЗагруженныеНастройки_НастройкиДокументов(ЭлементОбласть.Значение, СообщенияПользователю) Тогда
					ЗаписьВыполнена = Истина;
				ИначеЕсли ЭлементОбласть.Ключ = КлючОбластиНастройкиТаблиц() И
					ЗаписатьЗагруженныеНастройки_НастройкиТаблиц(ЭлементОбласть.Значение, СообщенияПользователю) Тогда
					ЗаписьВыполнена = Истина;
				ИначеЕсли ЭлементОбласть.Ключ = КлючОбластиДополнительныхНастроекТаблиц() И
					ЗаписатьЗагруженныеНастройки_ДополнительныхНастроекТаблиц(ЭлементОбласть.Значение, СообщенияПользователю) Тогда
					ЗаписьВыполнена = Истина;
				ИначеЕсли ЭлементОбласть.Ключ = КлючОбластиПользовательскиеЗапросы() И
					ЗаписатьЗагруженныеНастройки_ПользовательскиеЗапросы(ЭлементОбласть.Значение, СообщенияПользователю) Тогда
					ЗаписьВыполнена = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Для индекс = 0 По СообщенияПользователю.ВГраница() Цикл
			СообщенияПользователю[индекс].Сообщить();
		КонецЦикла;
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ВременныйКаталог = Неопределено;
		
		КолонкаВДеревеПуть = Параметры.ДеревоНастройки.Колонки.Найти("Путь");
		Если КолонкаВДеревеПуть <> Неопределено Тогда
			Параметры.ДеревоНастройки.Колонки.Удалить(КолонкаВДеревеПуть);
		КонецЕсли;
		
		ПоместитьВоВременноеХранилище(Параметры.ДеревоНастройки, АдресРезультата);
		
		Если ЗаписьВыполнена Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Настройки записаны'"));
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Запись'")), , 
			Метаданные.Обработки.SUI_ВыгрузкаЗагрузкаНастроек, , ИнформацияОбОшибке());
		Если ЗначениеЗаполнено(ВременныйКаталог) Тогда
			ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытия(ВложенноеСобытие = "")
	Возврат НСтр("ru = 'Выгрузка и загрузка настроек'") + ?(ПустаяСтрока(ВложенноеСобытие), "", "." + ВложенноеСобытие);
КонецФункции

Функция ПолучитьОтносительныйПуть(ЭлементМанифеста)
	
	ОтносительныйПуть = "";
	
	Если ЭлементМанифеста.Владелец().Тип() = ФабрикаXDTO.Тип("http://www.migration-settings.simple", "Settings") Тогда
		
		ОтносительныйПуть = ЭлементМанифеста.ВладеющееСвойство().Имя;
		
		ConfigurationТипXDTO = ФабрикаXDTO.Тип("http://www.migration-settings.simple", "Configuration");
		
		Владелец = ЭлементМанифеста.Владелец();
		
		Пока Истина Цикл
			
			Если Владелец = Неопределено Тогда
				Прервать;
			ИначеЕсли Владелец.Тип() = ConfigurationТипXDTO Тогда
				ОтносительныйПуть = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(Владелец.Name, Владелец.Version, ОтносительныйПуть);
				Прервать;
			КонецЕсли;
			
			Владелец = Владелец.Владелец();
			
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат ОтносительныйПуть;
	
КонецФункции

Функция ИнициализироватьКаталогЭлементаМанифеста(ВременныйКаталог, ЭлементМанифеста)
	
	Результат = Новый Структура("ОтносительныйПуть,АбсолютныйПуть", ПолучитьОтносительныйПуть(ЭлементМанифеста), "");
	
	Если ПустаяСтрока(Результат.ОтносительныйПуть) Тогда
		Результат = Неопределено;
	Иначе
		
		Результат.АбсолютныйПуть = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, Результат.ОтносительныйПуть);
		
		СоздатьКаталог(Результат.АбсолютныйПуть);
		
		Файл = Новый Файл(Результат.АбсолютныйПуть);
		ОбщегоНазначенияКлиентСервер.Проверить(Файл.ЭтоКаталог() И Файл.Существует(), НСтр("ru = 'Не удалось инициализировать временный каталог'"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьИмяФайла(ЭлементМанифеста, АбсолютныйПуть = Неопределено)
	
	ИмяФайла = XMLСтрока(ЭлементМанифеста.ID) + ".xml";
	
	Если АбсолютныйПуть <> Неопределено Тогда
		ИмяФайла = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(АбсолютныйПуть, ИмяФайла);
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ИмяФайлаМанифест(АбсолютныйПуть = Неопределено)
	
	ИмяФайла = "manifest.xml";
	
	Если АбсолютныйПуть <> Неопределено Тогда
		ИмяФайла = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(АбсолютныйПуть, ИмяФайла);
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ПолучитьСтрокиДереваНастроекКЗаписи(ДеревоНастроек, ВременныйКаталог)
	
	СтрокиКЗаписи = Новый Соответствие();
	
	ДеревоНастроек.Колонки.Добавить("Путь");
	
	Для Каждого СтрокаКонфигурации Из ДеревоНастроек.Строки Цикл
		
		Если СтрокаКонфигурации.Пометка = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаКонфигурации.КонфигурацияHEX) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не определена конфигурация настроек'"));
			Продолжить;
		КонецЕсли;
		
		ТекущийКаталогКонфигурации = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
			СтрокаКонфигурации.КонфигурацияИмя, СтрокаКонфигурации.КонфигурацияВерсия);
		
		Для Каждого СтрокаОбласти Из СтрокаКонфигурации.Строки Цикл
			
			Если СтрокаОбласти.Пометка = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаОбласти.Область) Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не определена область настроек'"));
			Продолжить;
			КонецЕсли;
			
			ТекущийКаталогОбласти = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
				ТекущийКаталогКонфигурации, СтрокаОбласти.Область);
			
			СтрокиОбласти = Новый Массив();
			Для Каждого СтрокаНастройки Из СтрокаОбласти.Строки Цикл
				
				Если СтрокаНастройки.Пометка <> 1 Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяФайла = XMLСтрока(СтрокаНастройки.НастройкаID) + ".xml";
				СтрокаНастройки.Путь = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
					ВременныйКаталог, ТекущийКаталогОбласти, ИмяФайла);
				
				СтрокиОбласти.Добавить(СтрокаНастройки);
				
			КонецЦикла;
			
			Если СтрокиОбласти.Количество() > 0 Тогда
				
				СтрокиОбластиИзСоответствия = СтрокиКЗаписи.Получить(СтрокаОбласти.Область);
				Если СтрокиОбластиИзСоответствия <> Неопределено Тогда
					СтрокиОбласти = ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиОбластиИзСоответствия, СтрокиОбласти);
				КонецЕсли;
				
				СтрокиКЗаписи.Вставить(СтрокаОбласти.Область, СтрокиОбласти);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СтрокиКЗаписи;
	
КонецФункции

Функция ПодготовитьЗапросБлокировкиДанных(ИмяОбласти, СтрокиНастроек)
	
	Запрос = Новый Запрос();
	
	Если ИмяОбласти = КлючОбластиНастройкиДокументов() Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Ссылка
			|ИЗ
			|	Справочник.SUI_НастройкиДокументовОбмена
			|ГДЕ
			|	Ссылка В (&Ссылка)
			|ДЛЯ ИЗМЕНЕНИЯ
			|	Справочник.SUI_НастройкиДокументовОбмена";
		
		Запрос.УстановитьПараметр("Ссылка", Новый Массив());
		
		Для Каждого СтрокаНастройки Из СтрокиНастроек Цикл
			
			Если ЗначениеЗаполнено(СтрокаНастройки.СопоставленнаяНастройка) Тогда
				Запрос.Параметры.Ссылка.Добавить(СтрокаНастройки.СопоставленнаяНастройка);
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ИмяОбласти = КлючОбластиНастройкиТаблиц() Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаИнтеграции,
			|	ИмяОбъектаКонфигурации
			|ИЗ
			|	РегистрСведений.SUI_НастройкиТаблицИнтеграции
			|ГДЕ
			|	ТаблицаИнтеграции В (&ТаблицаИнтеграции)
			|	И ИмяОбъектаКонфигурации В (&ИмяОбъектаКонфигурации)
			|ДЛЯ ИЗМЕНЕНИЯ
			|	РегистрСведений.SUI_НастройкиТаблицИнтеграции";
		
		Запрос.УстановитьПараметр("ТаблицаИнтеграции", Новый Массив());
		Запрос.УстановитьПараметр("ИмяОбъектаКонфигурации", Новый Массив());
		
		Для Каждого СтрокаНастройки Из СтрокиНастроек Цикл
			
			Если ЗначениеЗаполнено(СтрокаНастройки.НастройкаКлюч) Тогда
				Запрос.Параметры.ТаблицаИнтеграции.Добавить(СтрокаНастройки.НастройкаКлюч.ТаблицаИнтеграции);
				Запрос.Параметры.ИмяОбъектаКонфигурации.Добавить(СтрокаНастройки.НастройкаКлюч.ИмяОбъектаКонфигурации);
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ИмяОбласти = КлючОбластиДополнительныхНастроекТаблиц() Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаИнтеграции
			|ИЗ
			|	РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции
			|ГДЕ
			|	ТаблицаИнтеграции В (&ТаблицаИнтеграции)
			|ДЛЯ ИЗМЕНЕНИЯ
			|	РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции";
		
		Запрос.УстановитьПараметр("ТаблицаИнтеграции", Новый Массив());
		
		Для Каждого СтрокаНастройки Из СтрокиНастроек Цикл
			
			Если ЗначениеЗаполнено(СтрокаНастройки.НастройкаКлюч) Тогда
				Запрос.Параметры.ТаблицаИнтеграции.Добавить(СтрокаНастройки.НастройкаКлюч.ТаблицаИнтеграции);
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ИмяОбласти = КлючОбластиПользовательскиеЗапросы() Тогда
		
		Выбрать = Новый Массив();
		ВыбратьИЗ = Новый Массив();
		ДляИзменения = Новый Массив();
		Для Каждого СтрокаНастройки Из СтрокиНастроек Цикл
			
			Если СтрокаНастройки.НастройкаКлюч = "ПользовательскийЗапрос" Тогда
				Выбрать.Добавить("SUI_ПользовательскийЗапрос.Значение КАК Значение_SUI_ПользовательскийЗапрос");
				ВыбратьИЗ.Добавить("Константа.SUI_ПользовательскийЗапрос КАК SUI_ПользовательскийЗапрос");
				ДляИзменения.Добавить("Константа.SUI_ПользовательскийЗапрос");
			ИначеЕсли СтрокаНастройки.НастройкаКлюч = "ЗапросПолученияОстатковИЦен" Тогда
				Выбрать.Добавить("SUI_ЗапросПолученияОстатковИЦен.Значение КАК Значение_SUI_ЗапросПолученияОстатковИЦен");
				ВыбратьИЗ.Добавить("Константа.SUI_ЗапросПолученияОстатковИЦен КАК SUI_ЗапросПолученияОстатковИЦен");
				ДляИзменения.Добавить("Константа.SUI_ЗапросПолученияОстатковИЦен");
			КонецЕсли;
			
		КонецЦикла;
		
		Если Выбрать.Количество() > 0 Тогда
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	" + СтрСоединить(Выбрать, ",") + "
				|ИЗ
				|	" + СтрСоединить(ВыбратьИЗ, ",") + "
				|ДЛЯ ИЗМЕНЕНИЯ
				|	" + СтрСоединить(ДляИзменения, ",");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ?(ПустаяСтрока(Запрос.Текст), Неопределено, Запрос);
	
КонецФункции

#Область Выгрузка

Процедура ВыгрузитьНастройкиДокументов(ОписаниеКонфигурации, Дерево, ВременныйКаталог)
	
	НастройкиСтроки = Дерево.Строки.Найти(КлючОбластиНастройкиДокументов(), "Область", Ложь);
	
	Если НастройкиСтроки = Неопределено Тогда
		Возврат;
	Иначе
		НастройкиСтроки = НастройкиСтроки.Строки.НайтиСтроки(Новый Структура("Пометка", 1), Ложь);
	КонецЕсли;
	
	Если НастройкиСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеКонфигурации.Settings.Documents = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.migration-settings.simple", "Setting"));
	
	Результат = ИнициализироватьКаталогЭлементаМанифеста(ВременныйКаталог, ОписаниеКонфигурации.Settings.Documents);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для индекс = 0 По НастройкиСтроки.ВГраница() Цикл
		
		МетаФайл = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.migration-settings.simple", "File"));
		
		МетаФайл.ID = НастройкиСтроки[индекс].НастройкаID;
		МетаФайл.Key = XMLСтрока(НастройкиСтроки[индекс].НастройкаКлюч);
		МетаФайл.Name = НастройкиСтроки[индекс].НастройкаНаименование;
		
		Если Не ПустаяСтрока(НастройкиСтроки[индекс].НастройкаОписание) Тогда
			МетаФайл.Description = НастройкиСтроки[индекс].НастройкаОписание;
		КонецЕсли;
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.ОткрытьФайл(СформироватьИмяФайла(МетаФайл, Результат.АбсолютныйПуть));
		ЗаписьXML.ЗаписатьБезОбработки(ОбщегоНазначения.ЗначениеВСтрокуXML(НастройкиСтроки[индекс].НастройкаКлюч.ПолучитьОбъект()));
		ЗаписьXML.Закрыть();
		
		ОписаниеКонфигурации.Settings.Documents.Files.Добавить(МетаФайл);
		
	КонецЦикла;
	
	Если ОписаниеКонфигурации.Settings.Documents.Files.Количество() = 0 Тогда
		УдалитьФайлы(Результат.АбсолютныйПуть, "*");
		ОписаниеКонфигурации.Settings.Documents = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьНастройкиТаблиц(ОписаниеКонфигурации, Дерево, ВременныйКаталог)
	
	НастройкиСтроки = Дерево.Строки.Найти(КлючОбластиНастройкиТаблиц(), "Область", Ложь);
	
	Если НастройкиСтроки = Неопределено Тогда
		Возврат;
	Иначе
		НастройкиСтроки = НастройкиСтроки.Строки.НайтиСтроки(Новый Структура("Пометка", 1), Ложь);
	КонецЕсли;
	
	Если НастройкиСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыИнтеграции = Новый Массив();
	ИменаОбъектов = Новый Массив();
	Для индекс = 0 По НастройкиСтроки.ВГраница() Цикл
		ТаблицыИнтеграции.Добавить(НастройкиСтроки[индекс].НастройкаКлюч.ТаблицаИнтеграции);
		ИменаОбъектов.Добавить(НастройкиСтроки[индекс].НастройкаКлюч.ИмяОбъектаКонфигурации);
	КонецЦикла;
	
	ПараметрыПолученияНастроек = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек(ТаблицыИнтеграции, ИменаОбъектов);
	
	НастройкиТаблиц = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(ПараметрыПолученияНастроек);
	
	Если НастройкиТаблиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиТаблиц.Свернуть("ТаблицаИнтеграции,ИмяОбъекта,ОсновнойОбъект,Используется,СхемаКомпоновкиДанных,НастройкиКомпоновкиДанных");
	
	ОписаниеКонфигурации.Settings.IntegrationTables = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.migration-settings.simple", "Setting"));
	
	Результат = ИнициализироватьКаталогЭлементаМанифеста(ВременныйКаталог, ОписаниеКонфигурации.Settings.IntegrationTables);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для индекс = 0 По НастройкиСтроки.ВГраница() Цикл
		
		Отбор = Новый Структура("ТаблицаИнтеграции,ИмяОбъекта");
		Отбор.Вставить("ТаблицаИнтеграции", НастройкиСтроки[индекс].НастройкаКлюч.ТаблицаИнтеграции);
		Отбор.Вставить("ИмяОбъекта", НастройкиСтроки[индекс].НастройкаКлюч.ИмяОбъектаКонфигурации);
		
		Данные = НастройкиТаблиц.НайтиСтроки(Отбор);
		Если Данные.Количество() = 0 Тогда
			Продолжить;
		Иначе
			Данные = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Данные[0]);
		КонецЕсли;
		
		МетаФайл = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.migration-settings.simple", "File"));
		
		МетаФайл.ID = НастройкиСтроки[индекс].НастройкаID;
		МетаФайл.Key = XMLСтрока(Отбор.ТаблицаИнтеграции) + "&" + Отбор.ИмяОбъекта;
		МетаФайл.Name = НастройкиСтроки[индекс].НастройкаНаименование;
		
		Если Не ПустаяСтрока(НастройкиСтроки[индекс].НастройкаОписание) Тогда
			МетаФайл.Description = НастройкиСтроки[индекс].НастройкаОписание;
		КонецЕсли;
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.ОткрытьФайл(СформироватьИмяФайла(МетаФайл, Результат.АбсолютныйПуть));
		ЗаписьXML.ЗаписатьБезОбработки(ОбщегоНазначения.ЗначениеВСтрокуXML(Данные));
		ЗаписьXML.Закрыть();
		
		ОписаниеКонфигурации.Settings.IntegrationTables.Files.Добавить(МетаФайл);
		
	КонецЦикла;
	
	Если ОписаниеКонфигурации.Settings.IntegrationTables.Files.Количество() = 0 Тогда
		УдалитьФайлы(Результат.АбсолютныйПуть, "*");
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьДополнительныхНастроекТаблиц(ОписаниеКонфигурации, Дерево, ВременныйКаталог)
	
	НастройкиСтроки = Дерево.Строки.Найти(КлючОбластиДополнительныхНастроекТаблиц(), "Область", Ложь);
	
	Если НастройкиСтроки = Неопределено Тогда
		Возврат;
	Иначе
		НастройкиСтроки = НастройкиСтроки.Строки.НайтиСтроки(Новый Структура("Пометка", 1), Ложь);
	КонецЕсли;
	
	Если НастройкиСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыИнтеграции = Новый Массив();
	Для индекс = 0 По НастройкиСтроки.ВГраница() Цикл
		ТаблицыИнтеграции.Добавить(НастройкиСтроки[индекс].НастройкаКлюч.ТаблицаИнтеграции);
	КонецЦикла;
	
	ДополнительныеНастройкиТаблиц = РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.ПолучитьНастройки(ТаблицыИнтеграции);
	
	Если ДополнительныеНастройкиТаблиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеКонфигурации.Settings.IntegrationAdditional = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.migration-settings.simple", "Setting"));
	
	Результат = ИнициализироватьКаталогЭлементаМанифеста(ВременныйКаталог, ОписаниеКонфигурации.Settings.IntegrationAdditional);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для индекс = 0 По НастройкиСтроки.ВГраница() Цикл
		
		Данные = ДополнительныеНастройкиТаблиц.Найти(НастройкиСтроки[индекс].НастройкаКлюч.ТаблицаИнтеграции, "ТаблицаИнтеграции");
		
		Если Данные = Неопределено Тогда
			Продолжить;
		Иначе
			Данные = Данные.ДополнительныеНастройки;
		КонецЕсли;
		
		МетаФайл = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.migration-settings.simple", "File"));
		
		МетаФайл.ID = НастройкиСтроки[индекс].НастройкаID;
		МетаФайл.Key = XMLСтрока(НастройкиСтроки[индекс].НастройкаКлюч.ТаблицаИнтеграции);
		МетаФайл.Name = НастройкиСтроки[индекс].НастройкаНаименование;
		
		Если Не ПустаяСтрока(НастройкиСтроки[индекс].НастройкаОписание) Тогда
			МетаФайл.Description = НастройкиСтроки[индекс].НастройкаОписание;
		КонецЕсли;
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.ОткрытьФайл(СформироватьИмяФайла(МетаФайл, Результат.АбсолютныйПуть));
		ЗаписьXML.ЗаписатьБезОбработки(ОбщегоНазначения.ЗначениеВСтрокуXML(Данные));
		ЗаписьXML.Закрыть();
		
		ОписаниеКонфигурации.Settings.IntegrationAdditional.Files.Добавить(МетаФайл);
		
	КонецЦикла;
	
	Если ОписаниеКонфигурации.Settings.IntegrationAdditional.Files.Количество() = 0 Тогда
		УдалитьФайлы(Результат.АбсолютныйПуть, "*");
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьПользовательскиеЗапросы(ОписаниеКонфигурации, Дерево, ВременныйКаталог)
	
	НастройкиСтроки = Дерево.Строки.Найти(КлючОбластиПользовательскиеЗапросы(), "Область", Ложь);
	
	Если НастройкиСтроки = Неопределено Тогда
		Возврат;
	Иначе
		НастройкиСтроки = НастройкиСтроки.Строки.НайтиСтроки(Новый Структура("Пометка", 1), Ложь);
	КонецЕсли;
	
	Если НастройкиСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеКонфигурации.Settings.IntegrationQuery = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.migration-settings.simple", "Setting"));
	
	Результат = ИнициализироватьКаталогЭлементаМанифеста(ВременныйКаталог, ОписаниеКонфигурации.Settings.IntegrationQuery);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для индекс = 0 По НастройкиСтроки.ВГраница() Цикл
		
		МетаФайл = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.migration-settings.simple", "File"));
		
		МетаФайл.ID = НастройкиСтроки[индекс].НастройкаID;
		МетаФайл.Key = XMLСтрока(НастройкиСтроки[индекс].НастройкаКлюч);
		МетаФайл.Name = НастройкиСтроки[индекс].НастройкаНаименование;
		
		Если Не ПустаяСтрока(НастройкиСтроки[индекс].НастройкаОписание) Тогда
			МетаФайл.Description = НастройкиСтроки[индекс].НастройкаОписание;
		КонецЕсли;
		
		Если НастройкиСтроки[индекс].НастройкаКлюч = "ПользовательскийЗапрос" Тогда
			Данные = SUI_НастройкиМетаданныхСервер.ПолучитьПользовательскийЗапрос();
		ИначеЕсли НастройкиСтроки[индекс].НастройкаКлюч = "ЗапросПолученияОстатковИЦен" Тогда
			Данные = SUI_НастройкиМетаданныхСервер.ПолучитьЗапросПолученияОстатковИЦен();
		Иначе
			Продолжить;
		КонецЕсли;
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.ОткрытьФайл(СформироватьИмяФайла(МетаФайл, Результат.АбсолютныйПуть));
		ЗаписьXML.ЗаписатьБезОбработки(ОбщегоНазначения.ЗначениеВСтрокуXML(Данные));
		ЗаписьXML.Закрыть();
		
		ОписаниеКонфигурации.Settings.IntegrationQuery.Files.Добавить(МетаФайл);
		
	КонецЦикла;
	
	Если ОписаниеКонфигурации.Settings.IntegrationQuery.Files.Количество() = 0 Тогда
		УдалитьФайлы(Результат.АбсолютныйПуть, "*");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьНастроек

Функция ЗаписатьЗагруженныеНастройки_НастройкиДокументов(СтрокиНастроек, СообщенияПользователю)
	
	ЗаписьВыполнена = Ложь;
	
	ЧтениеXML = Новый ЧтениеXML();
	
	Для индекс = 0 По СтрокиНастроек.ВГраница() Цикл
		
		ФайлНастройки = Новый Файл(СтрокиНастроек[индекс].Путь);
		Если Не ФайлНастройки.Существует() Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(НСтр("ru = '[%1] Файл настройки не найден'"), СтрокиНастроек[индекс].Представление);
			СообщенияПользователю.Добавить(Сообщение);
			Продолжить;
		КонецЕсли;
		
		ЧтениеXML.ОткрытьФайл(ФайлНастройки.ПолноеИмя);
		НастройкаДокументаИзФайла = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		
		Если ТипЗнч(НастройкаДокументаИзФайла) <> Тип("СправочникОбъект.SUI_НастройкиДокументовОбмена") Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(НСтр("ru = '[%1] Прочитанные данные настройки из файла не являются данными настройки документов.
			|Загрузка настройки пропущена.'"), СтрокиНастроек[индекс].Представление);
			СообщенияПользователю.Добавить(Сообщение);
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокиНастроек[индекс].СопоставленнаяНастройка) Тогда
			
			НастройкаДокумента = СтрокиНастроек[индекс].СопоставленнаяНастройка.ПолучитьОбъект();
			
			ЗаполнитьЗначенияСвойств(НастройкаДокумента, НастройкаДокументаИзФайла, , "Ссылка,ВерсияДанных,Родитель,Владелец");
			
			НастройкаДокумента.НастройкиТаблиц.Очистить();
			Для Каждого СтрокаТаблицыИзXML Из НастройкаДокументаИзФайла.НастройкиТаблиц Цикл
				ЗаполнитьЗначенияСвойств(НастройкаДокумента.НастройкиТаблиц.Добавить(), СтрокаТаблицыИзXML);
			КонецЦикла;
			
			НастройкаДокумента.НастройкиИдентификацииСтрок.Очистить();
			Для Каждого СтрокаТаблицыИзXML Из НастройкаДокументаИзФайла.НастройкиИдентификацииСтрок Цикл
				ЗаполнитьЗначенияСвойств(НастройкаДокумента.НастройкиИдентификацииСтрок.Добавить(), СтрокаТаблицыИзXML);
			КонецЦикла;
			
			НастройкаДокумента.ПостобработкаЗаполнениеРеквизитов.Очистить();
			Для Каждого СтрокаТаблицыИзXML Из НастройкаДокументаИзФайла.ПостобработкаЗаполнениеРеквизитов Цикл
				ЗаполнитьЗначенияСвойств(НастройкаДокумента.ПостобработкаЗаполнениеРеквизитов.Добавить(), СтрокаТаблицыИзXML);
			КонецЦикла;
			
			НастройкаДокумента.ПостобработкаСозданиеДокументовНаОсновании.Очистить();
			Для Каждого СтрокаТаблицыИзXML Из НастройкаДокументаИзФайла.ПостобработкаСозданиеДокументовНаОсновании Цикл
				ЗаполнитьЗначенияСвойств(НастройкаДокумента.ПостобработкаСозданиеДокументовНаОсновании.Добавить(), СтрокаТаблицыИзXML);
			КонецЦикла;
			
		Иначе
			
			НастройкаДокумента = НастройкаДокументаИзФайла;
			
			Если ТипЗнч(СтрокиНастроек[индекс].НастройкаКлюч) = Тип("УникальныйИдентификатор") И
				ЗначениеЗаполнено(СтрокиНастроек[индекс].НастройкаКлюч) Тогда
				
				СсылкаПоКлючу = Справочники.SUI_НастройкиДокументовОбмена.ПолучитьСсылку(СтрокиНастроек[индекс].НастройкаКлюч);
				НастройкаДокумента.УстановитьСсылкуНового(СсылкаПоКлючу);
				
			КонецЕсли;
			
			Пока ОбщегоНазначения.СсылкаСуществует(НастройкаДокумента.Ссылка) Цикл
				НоваяСсылка = Справочники.SUI_НастройкиДокументовОбмена.ПолучитьСсылку(Новый УникальныйИдентификатор());
				НастройкаДокумента.УстановитьСсылкуНового(НоваяСсылка);
			КонецЦикла;
			
			НастройкаДокумента.ДополнительныеСвойства.Вставить("ПривязатьМобильныеУстройства", Истина);
			
		КонецЕсли;
		
		Если Не НастройкаДокумента.ПроверитьЗаполнение() Тогда
			НастройкаДокумента.Используется = Ложь;
			НастройкаДокумента.ОбменДанными.Загрузка = Истина;
		КонецЕсли;
		
		НастройкаДокумента.Записать();
		
		СтрокиНастроек[индекс].СопоставленнаяНастройка = НастройкаДокумента.Ссылка;
		
		ЗаписьВыполнена = Истина;
		
		ПолученныеСообщения = ПолучитьСообщенияПользователю(Истина);
		Если ПолученныеСообщения.Количество() > 0 Тогда
			СообщениеПользователю = Новый СообщениеПользователю();
			СообщениеПользователю.Текст = СтрШаблон("[%1] %2", 
				СтрокиНастроек[индекс].Представление, 
				СтрСоединить(ПолученныеСообщения, Символы.ПС));
			СообщенияПользователю.Добавить(СообщениеПользователю);
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	Возврат ЗаписьВыполнена;
	
КонецФункции

Функция ЗаписатьЗагруженныеНастройки_НастройкиТаблиц(СтрокиНастроек, СообщенияПользователю)
	
	ЗаписьВыполнена = Ложь;
	
	ТаблицаЗаписи = Новый ТаблицаЗначений();
	ТаблицаЗаписи.Колонки.Добавить("ТаблицаИнтеграции", Новый ОписаниеТипов("ПеречислениеСсылка.SUI_ТаблицыИнтеграции"));
	ТаблицаЗаписи.Колонки.Добавить("ИмяОбъекта", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ТаблицаЗаписи.Колонки.Добавить("ОсновнойОбъект", Новый ОписаниеТипов("Булево"));
	ТаблицаЗаписи.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
	ТаблицаЗаписи.Колонки.Добавить("СхемаКомпоновкиДанных", Новый ОписаниеТипов("СхемаКомпоновкиДанных"));
	ТаблицаЗаписи.Колонки.Добавить("НастройкиКомпоновкиДанных", Новый ОписаниеТипов("НастройкиКомпоновкиДанных"));
	
	ЧтениеXML = Новый ЧтениеXML();
	
	Для индекс = 0 По СтрокиНастроек.ВГраница() Цикл
		
		ТаблицаЗаписи.Очистить();
		
		ФайлНастройки = Новый Файл(СтрокиНастроек[индекс].Путь);
		Если Не ФайлНастройки.Существует() Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(НСтр("ru = '[%1] Файл настройки не найден'"), СтрокиНастроек[индекс].Представление);
			СообщенияПользователю.Добавить(Сообщение);
			Продолжить;
		КонецЕсли;
		
		ЧтениеXML.ОткрытьФайл(ФайлНастройки.ПолноеИмя);
		ЗаполнитьЗначенияСвойств(ТаблицаЗаписи.Добавить(), СериализаторXDTO.ПрочитатьXML(ЧтениеXML));
		
		РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ЗагрузитьНастройки(ТаблицаЗаписи, , ЗаписьВыполнена);
		
		ПолученныеСообщения = ПолучитьСообщенияПользователю(Истина);
		Если ПолученныеСообщения.Количество() > 0 Тогда
			СообщениеПользователю = Новый СообщениеПользователю();
			СообщениеПользователю.Текст = СтрШаблон("[%1] %2", 
				СтрокиНастроек[индекс].Представление, 
				СтрСоединить(ПолученныеСообщения, Символы.ПС));
			СообщенияПользователю.Добавить(СообщениеПользователю);
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	Возврат ЗаписьВыполнена;
	
КонецФункции

Функция ЗаписатьЗагруженныеНастройки_ДополнительныхНастроекТаблиц(СтрокиНастроек, СообщенияПользователю)
	
	ЗаписьВыполнена = Ложь;
	
	ЧтениеXML = Новый ЧтениеXML();
	
	ДополнительныеНастройки = Новый Соответствие();
	НастраиваемыеТаблицы = РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции
		.ТаблицыИнтеграцииДополнительныхНастроек();
	
	Для индекс = 0 По СтрокиНастроек.ВГраница() Цикл
		
		ФайлНастройки = Новый Файл(СтрокиНастроек[индекс].Путь);
		Если Не ФайлНастройки.Существует() Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(НСтр("ru = '[%1] Файл настройки не найден'"), СтрокиНастроек[индекс].Представление);
			СообщенияПользователю.Добавить(Сообщение);
			Продолжить;
		КонецЕсли;
		
		ЧтениеXML.ОткрытьФайл(ФайлНастройки.ПолноеИмя);
		
		ТаблицаИнтеграции = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтрокиНастроек[индекс].НастройкаКлюч, 
			"ТаблицаИнтеграции", 
			Перечисления.SUI_ТаблицыИнтеграции.ПустаяСсылка(), 
			Тип("ПеречислениеСсылка.SUI_ТаблицыИнтеграции"));
		
		Если НастраиваемыеТаблицы.Найти(ТаблицаИнтеграции) = Неопределено Тогда
			ШаблонСообщения = НСтр("ru = '[%1] Таблица не входит в состав настраиваемых дополнительных настроек'");
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокиНастроек[индекс].Представление);
			СообщенияПользователю.Добавить(Сообщение);
			Продолжить;
		КонецЕсли;
		
		ДополнительныеНастройки.Вставить(ТаблицаИнтеграции, СериализаторXDTO.ПрочитатьXML(ЧтениеXML));
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.СохранитьНастройки(ДополнительныеНастройки);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СообщенияПользователю, ПолучитьСообщенияПользователю(Истина));
	
	Возврат ЗаписьВыполнена;
	
КонецФункции

Функция ЗаписатьЗагруженныеНастройки_ПользовательскиеЗапросы(СтрокиНастроек, СообщенияПользователю)
	
	ЗаписьВыполнена = Ложь;
	
	ЧтениеXML = Новый ЧтениеXML();
	
	Для индекс = 0 По СтрокиНастроек.ВГраница() Цикл
		
		ФайлНастройки = Новый Файл(СтрокиНастроек[индекс].Путь);
		Если Не ФайлНастройки.Существует() Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(НСтр("ru = '[%1] Файл настройки не найден'"), СтрокиНастроек[индекс].Представление);
			СообщенияПользователю.Добавить(Сообщение);
			Продолжить;
		КонецЕсли;
		
		ЧтениеXML.ОткрытьФайл(ФайлНастройки.ПолноеИмя);
		
		Если СтрокиНастроек[индекс].НастройкаКлюч = "ПользовательскийЗапрос" Тогда
			SUI_НастройкиМетаданныхСервер.СохранитьПользовательскийЗапрос(СериализаторXDTO.ПрочитатьXML(ЧтениеXML));
			ЗаписьВыполнена = Истина;
		ИначеЕсли СтрокиНастроек[индекс].НастройкаКлюч = "ЗапросПолученияОстатковИЦен" Тогда
			SUI_НастройкиМетаданныхСервер.СохранитьЗапросПолученияОстатковИЦен(СериализаторXDTO.ПрочитатьXML(ЧтениеXML));
			ЗаписьВыполнена = Истина;
		КонецЕсли;
		
		ПолученныеСообщения = ПолучитьСообщенияПользователю(Истина);
		Если ПолученныеСообщения.Количество() > 0 Тогда
			СообщениеПользователю = Новый СообщениеПользователю();
			СообщениеПользователю.Текст = СтрШаблон("[%1] %2", 
				СтрокиНастроек[индекс].Представление, 
				СтрСоединить(ПолученныеСообщения, Символы.ПС));
			СообщенияПользователю.Добавить(СообщениеПользователю);
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	Возврат ЗаписьВыполнена;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
